* Scripts to be called using RemoteAPI

Ant buil.xml script included in ~/data~ folder lets you call any service that implements 
~org.akvo.gae.remoteapi.RemoteAPI~ included in this folder ~data/src/org/akvo/gae/remoteapi~
 
 #+BEGIN_SRC shell
  cd data/src/org/akvo/gae/remoteapi
  ls
 #+END_SRC

 #+RESULTS:
 | AddPermission.java                      |
 | AddUsers.java                           |
 | CheckDataPointLocation.java             |
 | CheckImages.java                        |
 | CheckMissingFiles.java                  |
 | CheckOptions.java                       |
 | CheckParentPath.java                    |
 | CheckSurveyInstance.java                |
 | CheckSurveyStructure.java               |
 | CorrectFolderSurveyPath.java            |
 | CorrectSurveyedLocale.java              |
 | DataPoints.java                         |
 | DataStoreWithUnilog.java                |
 | DataUtils.java                          |
 | DefaultUserRoles.java                   |
 | DeleteData.java                         |
 | DeleteFormCompletely.java               |
 | DeleteQuestionWithoutQuestionGroup.java |
 | DeleteSurveyIfEmpty.java                |
 | DeleteSurveyInstances.java              |
 | DeleteUsers.java                        |
 | DeviceList.java                         |
 | ExportAuthDataToEventLog.java           |
 | ExportDataToEventLog.java               |
 | ExportDataToPG.java                     |
 | ExtractImageGeotag.java                 |
 | FixDeviceFileJobQueue.java              |
 | FixSurveyedLocale.java                  |
 | InstanceStats.java                      |
 | LetsEncryptAppUrl.java                  |
 | NameEqualsCodeCleanup.java              |
 | PathToIdMigration.java                  |
 | PilotDataFix.java                       |
 | PrintTreeStructure.java                 |
 | Process.java                            |
 | ProjectMigration.java                   |
 | PublicPrivateInstanceCount.java         |
 | RemoteAPI.java                          |
 | SatStatUpdater.java                     |
 | SplitAssignments.java                   |
 | SurveyedLocaleFix.java                  |
 | UnAssignUnPublishedForms.java           |
 | UserList.java                           |


** calling a RemoteAPIService

#+BEGIN_SRC 
ant remoteAPI -DappId=akvoflow-uat2 -Dservice=UnifyDataPointAssignment
#+END_SRC

By default akvo-server-config/*/*.p12 auth files are taken from this relative path ~../../../akvo-flow-server-config~ but if you have another one, just specify it in the call

#+BEGIN_SRC 
ant remoteAPI -DappId=akvoflow-uat2 -Dservice=UnifyDataPointAssignment -DakvoFlowServerConfigPath=/your-path-to-akvo-flow-server-config
#+END_SRC


* FAQ

** why is better to use ANT instead of *.sh file?
Thus ANT build.xml includes java path configuration and takes care of always ~compile~ before calling the RemoteAPIService
